Catalogs/ЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыРаботыСКандидатами</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКандидатовНаЗадержку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПроверкиКандидатовНаЗадержку</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияЗадержкиКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонятьЗадержавшихсяКандидатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтклоненияЗадержавшихсяКандидатов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияЗадержкиКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПодбораПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодбораПерсонала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьПодборПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСогласованиеВакансий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗаявкиНаПодборПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрытиеВакансииТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПоискКандидатовНаИнтернетСайтах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейДоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейДоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаАвтоматическогоОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодРаботыСВакансией</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПериодаРаботыСВакансией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККаталогуMuPDF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСервисСемантическогоАнализа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьСкрытиеПерсональныхДанныхКандидатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦветаЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦветаЭтаповРаботыСКандидатами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОпределенияЗадержкиКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияЗадержкиКандидатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВНастройках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВЭтапе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭтапыРаботыСКандидатами/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	ПолучитьЦветаЭтапа();
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьЦветаЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьУсловноеОформление");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроверятьКандидатовНаЗадержкуПриИзменении(Элемент)
	
	УстановитьСвойстваСпособаПроверкиКандидатовНаЗадержку(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКандидатовНаЗадержкуКакВНастройкахПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКандидатовНаЗадержкуКакВКарточкеПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонятьЗадержавшихсяКандидатовПриИзменении(Элемент)
	
	УстановитьСвойстваСпособаОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонятьЗадержавшихсяКандидатовКакВНастройкахПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонятьЗадержавшихсяКандидатовКакВКарточкеПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикОповещенияЦветТекстаВыборНажатие", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Цвет", ЦветТекста);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦветаКорпоративная", ПараметрыОткрытияФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикОповещенияЦветФонаВыборНажатие", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Цвет", ЦветФона);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦветаКорпоративная", ПараметрыОткрытияФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	СброситьЦветТекста();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	СброситьЦветФона();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОчиститьЦвет(Команда)
	
	Модифицированность = Истина;
	СброситьЦветТекста();
	СброситьЦветФона();
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе = ПолучитьФункциональнуюОпцию("ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе");
	ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе = ПолучитьФункциональнуюОпцию("ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе");
	Если Не ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе И Не ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		Элементы.ГруппаЗадержкаНаЭтапеКандидатов.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПроверятьКандидатовНаЗадержку.Видимость = ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе;
		Элементы.ГруппаОтклонятьЗадержавшихсяКандидатов.Видимость = ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе;
		НастройкиПодбораПерсонала = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	КонецЕсли;
	
	Если ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		ДнейДоСообщения = НастройкиПодбораПерсонала.ДнейДоСообщения;
		УстановитьСвойстваСпособаПроверкиКандидатовНаЗадержку(ЭтотОбъект, ТекущийОбъект);
		ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(ЭтотОбъект, ТекущийОбъект)
	КонецЕсли;
	Если ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		ДнейДоОтклонения = НастройкиПодбораПерсонала.ДнейДоОтклонения;
		УстановитьСвойстваСпособаОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект, ТекущийОбъект);
		ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.ЭтапыРаботыСКандидатами) Тогда
		Элементы.ФормаОчиститьЦвет.Видимость = Ложь;
		Элементы.ЦветТекста.ТолькоПросмотр = Истина;
		Элементы.ЦветФона.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПолучитьЦветаЭтапа()
	
	Если Параметры.Ключ.Пустая() Тогда
		ЦветТекста = WebЦвета.Черный;
		ЦветФона = WebЦвета.Белый;
		Возврат;
	КонецЕсли;
	
	ЦветаЭтапа = РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.
		ЦветаЭтаповРаботыСКандидатами(Объект.Ссылка);
	
	ЦветТекста = ЦветаЭтапа.ЦветТекста;
	ЦветФона = ЦветаЭтапа.ЦветФона;
	
	Элементы.Наименование.ЦветТекста = ЦветТекста;
	Элементы.Наименование.ЦветФона = ЦветФона;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЦветТекста()
	
	ЦветТекста = WebЦвета.Черный;
	Элементы.Наименование.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЦветФона()
	
	ЦветФона = WebЦвета.Белый;
	Элементы.Наименование.ЦветФона = ЦветФона;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещенияЦветТекстаВыборНажатие(ПолученныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ПолученныйЦвет = Неопределено Или ПолученныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЦветТекста = ПолученныйЦвет;
	Элементы.Наименование.ЦветТекста = ПолученныйЦвет;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещенияЦветФонаВыборНажатие(ПолученныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ПолученныйЦвет = Неопределено Или ПолученныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЦветФона = ПолученныйЦвет;
	Элементы.Наименование.ЦветФона = ПолученныйЦвет;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦветаЭтапа()
	
	РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.ЗаписатьЦвета(Объект.Ссылка, ЦветТекста, ЦветФона);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСпособаПроверкиКандидатовНаЗадержку(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаСпособПроверкиКандидатовНаЗадержку",
		"Доступность",
		Объект.ПроверятьКандидатовНаЗадержку = Истина);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ДнейДоСообщенияНаЭтапе",
		"ТолькоПросмотр",
		Объект.СпособПроверкиКандидатовНаЗадержку <>
			ПредопределенноеЗначение("Перечисление.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе"));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСпособаОтклоненияЗадержавшихсяКандидатов(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаСпособОтклоненияЗадержавшихсяКандидатов",
		"Доступность",
		Объект.ОтклонятьЗадержавшихсяКандидатов = Истина);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ДнейДоОтклоненияНаЭтапе",
		"ТолькоПросмотр",
		Объект.СпособОтклоненияЗадержавшихсяКандидатов <>
			ПредопределенноеЗначение("Перечисление.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе"));
		
КонецПроцедуры

#КонецОбласти
